# IsProfileEdge Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..IsProfileEdge Method
Form Class See Also
---
Tell if an edge or curve is generated from a profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsProfileEdge(
	Reference curveOrEdgeReference
)
```

Visual Basic
---
```text
Public Function IsProfileEdge ( _
	curveOrEdgeReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool IsProfileEdge(
	Reference^ curveOrEdgeReference
)
```

# ### Parameters
curveOrEdgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe reference of the edge or curve to be checked.
# See Also
Form Class
Autodesk.Revit.DB Namespace